[6836_IT_2025-01-22.txt](https://github.com/user-attachments/files/18509413/6836_IT_2025-01-22.txt)

TF plan when deploying `shared`:

```
Terraform will perform the following actions:

  # aws_config_configuration_recorder.shared will be updated in-place
  ~ resource "aws_config_configuration_recorder" "shared" {
        id       = "azul-awsconfig-tempdev"
        name     = "azul-awsconfig-tempdev"
      ~ role_arn = "arn:aws:iam::654654270592:role/azul-aws_config" -> (known after apply)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_role.aws_config will be destroyed
  # (because aws_iam_role.aws_config is not in configuration)
  - resource "aws_iam_role" "aws_config" {
      - arn                   = "arn:aws:iam::654654270592:role/azul-aws_config" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "config.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-01-22T03:05:33Z" -> null
      - force_detach_policies = false -> null
      - id                    = "azul-aws_config" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWS_ConfigRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "azul-aws_config" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Name"                = "azul-aws_config"
          - "billing"             = "anvil"
          - "component"           = "azul-aws_config"
          - "deployment"          = "tempdev"
          - "owner"               = "hannes@ucsc.edu"
          - "service"             = "azul"
          - "terraform_component" = "shared"
        } -> null
      - tags_all              = {
          - "Name"                = "azul-aws_config"
          - "billing"             = "anvil"
          - "component"           = "azul-aws_config"
          - "deployment"          = "tempdev"
          - "owner"               = "hannes@ucsc.edu"
          - "service"             = "azul"
          - "terraform_component" = "shared"
        } -> null
      - unique_id             = "AROAZQ3DPNSADTADDVL42" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "azul-aws_config" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:*",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::edu-ucsc-gi-platform-temp-dev-awsconfig.us-east-1",
                              - "arn:aws:s3:::edu-ucsc-gi-platform-temp-dev-awsconfig.us-east-1/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.aws_config will be destroyed
  # (because aws_iam_role_policy.aws_config is not in configuration)
  - resource "aws_iam_role_policy" "aws_config" {
      - id          = "azul-aws_config:azul-aws_config" -> null
      - name        = "azul-aws_config" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::edu-ucsc-gi-platform-temp-dev-awsconfig.us-east-1",
                          - "arn:aws:s3:::edu-ucsc-gi-platform-temp-dev-awsconfig.us-east-1/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "azul-aws_config" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.aws_config will be destroyed
  # (because aws_iam_role_policy_attachment.aws_config is not in configuration)
  - resource "aws_iam_role_policy_attachment" "aws_config" {
      - id         = "azul-aws_config-20250122030533617100000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWS_ConfigRole" -> null
      - role       = "azul-aws_config" -> null
    }

  # aws_iam_service_linked_role.aws_config will be created
  + resource "aws_iam_service_linked_role" "aws_config" {
      + arn              = (known after apply)
      + aws_service_name = "config.amazonaws.com"
      + create_date      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + tags             = {
          + "Name"                = "azul-aws_config"
          + "billing"             = "anvil"
          + "component"           = "azul-aws_config"
          + "deployment"          = "tempdev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all         = {
          + "Name"                = "azul-aws_config"
          + "billing"             = "anvil"
          + "component"           = "azul-aws_config"
          + "deployment"          = "tempdev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + unique_id        = (known after apply)
    }

Plan: 1 to add, 1 to change, 3 to destroy.

Warnings:

- Argument is deprecated
  on shared.tf.json line 95 (and 3 more)

To see the full warning notes, run Terraform without -compact-warnings.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_iam_role_policy_attachment.aws_config: Destroying... [id=azul-aws_config-20250122030533617100000001]
aws_iam_role_policy.aws_config: Destroying... [id=azul-aws_config:azul-aws_config]
aws_iam_service_linked_role.aws_config: Creating...
aws_iam_role_policy_attachment.aws_config: Destruction complete after 1s
aws_iam_role_policy.aws_config: Destruction complete after 1s
aws_iam_role.aws_config: Destroying... [id=azul-aws_config]
aws_iam_service_linked_role.aws_config: Creation complete after 1s [id=arn:aws:iam::654654270592:role/aws-service-role/config.amazonaws.com/AWSServiceRoleForConfig]
aws_iam_role.aws_config: Destruction complete after 0s
aws_config_configuration_recorder.shared: Modifying... [id=azul-awsconfig-tempdev]
aws_config_configuration_recorder.shared: Modifications complete after 1s [id=azul-awsconfig-tempdev]

Apply complete! Resources: 1 added, 1 changed, 3 destroyed.
```

Note that the previous inline policy to allow s3 actions, and the attachment of the `AWS_ConfigRole` policy could not be applied to the new `AWSServiceRoleForConfig` service-linked role (due to it being an AWS managed role), however these additions are not required as they are covered by `AWSServiceRoleForConfig`'s policy `AWSConfigServiceRolePolicy`



![Screenshot 2025-01-21 at 7 11 29 PM](https://github.com/user-attachments/assets/4209c15d-a9b7-409a-ab15-860914f9e8a3)


![Screenshot 2025-01-22 at 9 41 26 AM](https://github.com/user-attachments/assets/d709fdb6-f671-42e5-8bc9-40f8a455cd77)
